; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v7 - type_1 ?v6 - type_2)
 	      (pred_2 ?v5 - object ?v6 - type_2)
	      (pred_3 ?v7 - type_1 ?v8 - type_3)
	      (pred_1 ?v7 - type_1 ?v5 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v7 - type_1 ?v1 ?v2 - type_2)
       :precondition (and  (pred_4 ?v7 ?v1))
       :effect (and  (pred_4 ?v7 ?v2)
		     (not (pred_4 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_1 ?v4 - object ?v3 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v3) (pred_4 ?v7 ?v3) (pred_3 ?v7 ?v8))
       :effect (and (pred_1 ?v7 ?v4 ?v8)
		    (not (pred_2 ?v4 ?v3)) 
		    (not (pred_3 ?v7 ?v8))))

   (:action op_1
       :parameters (?v7 - type_1 ?v4 - object ?v3 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v4 ?v8) (pred_4 ?v7 ?v3))
       :effect (and (pred_2 ?v4 ?v3)
		    (pred_3 ?v7 ?v8)
		    (not (pred_1 ?v7 ?v4 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_02 - type_1
obj_07 obj_14 obj_03 obj_10 - type_3
obj_08 obj_04 obj_13 obj_01 - type_2
obj_05 obj_12 obj_09 obj_11 - object)
(:init
(pred_4 obj_06 obj_04)
(pred_3 obj_06 obj_07)
(pred_3 obj_06 obj_14)
(pred_4 obj_02 obj_04)
(pred_3 obj_02 obj_03)
(pred_3 obj_02 obj_10)
(pred_2 obj_05 obj_04)
(pred_2 obj_12 obj_13)
(pred_2 obj_09 obj_01)
(pred_2 obj_11 obj_04)
)
(:goal
(and
(pred_2 obj_05 obj_08)
(pred_2 obj_12 obj_04)
(pred_2 obj_09 obj_04)
(pred_2 obj_11 obj_13)
)
)

(:constraints
  (always (not (pred_4 obj_06 obj_13)))
)
)

; plan
1. (op_2 obj_02 obj_05 obj_04 obj_10)
   deleted: (pred_2 obj_05 obj_04) (pred_3 obj_02 obj_10)
   added: (pred_1 obj_02 obj_05 obj_10)
   goals met: 0 of 4
2. (op_2 obj_06 obj_11 obj_04 obj_14)
   deleted: (pred_2 obj_11 obj_04) (pred_3 obj_06 obj_14)
   added: (pred_1 obj_06 obj_11 obj_14)
   goals met: 0 of 4
3. (op_3 obj_02 obj_04 obj_08)
   deleted: (pred_4 obj_02 obj_04)
   added: (pred_4 obj_02 obj_08)
   goals met: 0 of 4
4. (op_1 obj_02 obj_05 obj_08 obj_10)
   deleted: (pred_1 obj_02 obj_05 obj_10)
   added: (pred_2 obj_05 obj_08) (pred_3 obj_02 obj_10)
   goals met: 1 of 4
5. (op_3 obj_02 obj_08 obj_01)
   deleted: (pred_4 obj_02 obj_08)
   added: (pred_4 obj_02 obj_01)
   goals met: 1 of 4
6. (op_2 obj_02 obj_09 obj_01 obj_10)
   deleted: (pred_2 obj_09 obj_01) (pred_3 obj_02 obj_10)
   added: (pred_1 obj_02 obj_09 obj_10)
   goals met: 1 of 4
7. (op_3 obj_02 obj_01 obj_04)
   deleted: (pred_4 obj_02 obj_01)
   added: (pred_4 obj_02 obj_04)
   goals met: 1 of 4
8. (op_1 obj_02 obj_09 obj_04 obj_10)
   deleted: (pred_1 obj_02 obj_09 obj_10)
   added: (pred_2 obj_09 obj_04) (pred_3 obj_02 obj_10)
   goals met: 2 of 4
9. (op_3 obj_02 obj_04 obj_13)
   deleted: (pred_4 obj_02 obj_04)
   added: (pred_4 obj_02 obj_13)
   goals met: 2 of 4
10. (op_2 obj_02 obj_12 obj_13 obj_10)
   deleted: (pred_2 obj_12 obj_13) (pred_3 obj_02 obj_10)
   added: (pred_1 obj_02 obj_12 obj_10)
   goals met: 2 of 4
11. (op_3 obj_02 obj_13 obj_04)
   deleted: (pred_4 obj_02 obj_13)
   added: (pred_4 obj_02 obj_04)
   goals met: 2 of 4
12. (op_1 obj_06 obj_11 obj_04 obj_14)
   deleted: (pred_1 obj_06 obj_11 obj_14)
   added: (pred_2 obj_11 obj_04) (pred_3 obj_06 obj_14)
   goals met: 2 of 4
13. (op_1 obj_02 obj_12 obj_04 obj_10)
   deleted: (pred_1 obj_02 obj_12 obj_10)
   added: (pred_2 obj_12 obj_04) (pred_3 obj_02 obj_10)
   goals met: 3 of 4
14. (op_2 obj_02 obj_11 obj_04 obj_10)
   deleted: (pred_2 obj_11 obj_04) (pred_3 obj_02 obj_10)
   added: (pred_1 obj_02 obj_11 obj_10)
   goals met: 3 of 4
15. (op_3 obj_02 obj_04 obj_13)
   deleted: (pred_4 obj_02 obj_04)
   added: (pred_4 obj_02 obj_13)
   goals met: 3 of 4
16. (op_1 obj_02 obj_11 obj_13 obj_10)
   deleted: (pred_1 obj_02 obj_11 obj_10)
   added: (pred_2 obj_11 obj_13) (pred_3 obj_02 obj_10)
   goals met: 4 of 4
